HelpfulTools/HelpfulTools.org
**** Multiple workspaces in Windows

    1. How to add a desktop in Windows 10:
       To add a virtual desktop, open up the new Task View pane by clicking the Task View button (two overlapping rectangles) on the taskbar, or by pressing the Windows Key + Tab. In the Task View pane, click New desktop to add a virtual desktop. If you have two or more desktops already open, the "Add a desktop" button will appear as a gray tile with a plus symbol. You can also quickly add a desktop without entering the Task View pane by using the keyboard shortcut Windows Key + Ctrl + D.

    2. How to switch between desktops:
       To switch between virtual desktops, open the Task View pane and click on the desktop you want to switch to. You can also quickly switch desktops without going into the Task View pane by using the keyboard shortcuts Windows Key + Ctrl + Left Arrow and Windows Key + Ctrl + Right Arrow.

    3. Move windows between desktops:
       To move a window from one desktop to another, you first have to open up the Task View pane and then hover over the desktop containing the window you want to move. The windows on that desktop will pop up; find the window you want to move, right-click it, and go to Move to and choose the desktop you want to move the window to. You can also drag and drop windows -- grab the window you want to move and drag it into the desired desktop.

    4. Close a desktop:
       To close a virtual desktop, open up the Task View pane and hover over the desktop you want to close until a small X appears in the upper right corner. Click the X to close the desktop. You can also close desktops without going into the Task View pane by using the keyboard shortcut Windows Key + Ctrl + F4 (this will close the desktop you're currently on).

-----------------------------------------------------------------------------------------

*** Ready API/Soap UI preferences

UI - Workspace type : Tabbed Desktop

ReadyAPI - Default SOAP request editor : XML
           Default REST request editor : Request
           Default response editor : XML

Groovy_script_to_read_attributes_from_response_in_SoapUI_and_write_contents_to_a_file

    #+BEGIN_EXAMPLE
    import com.eviware.soapui.support.XmlHolder
    
    def response = testRunner.testCase.testSteps["TestRequest"].testRequest.response.getRequest().getResponseContentAsXml()
    
    def responseAsXml = new XmlHolder( response )
    
    responseAsXml.declareNamespace( 'ns2', 'http://abcd.com/test/xyz/service/specificservice/v1_0')
    
    def RqUID = responseAsXml.getNodeValue("//ns2:getResponse/response/RqUID")
    log.info("RqUID [" + RqUID + "]")
    
    def payload = responseAsXml.getNodeValue("//ns2:getResponse/response/Payload")
    log.info("payl [" + payload + "]")
    
    def responseFile = new PrintWriter ("C:\\Users\\explorer\\Downloads\\folder\\" + RqUID + ".txt")
    
    responseFile.println(payload)
    
    responseFile.flush()
    
    responseFile.close()

    #+END_EXAMPLE

-----------------------------------------------------------------------------------------

*** Android alternatives

GrapheneOS
LineageOS (supports many older devices)

Look into these as well:
Sprinboard Volla - phone
Cosmo Communicator - phone
Proix - phone

Purism librem 5 -> Not recommended
Pinephone is the better alternative
Regarding the OS that can be used on Pinephone, UBPorts (Ubuntu Touch) is recommended.

What do people use for maps when using Linux phones?

-----------------------------------------------------------------------------------------

*** Browser choices

    If you are not happy with firefox, here are some alternatives:
    LibreWolf
    vimb
    qutebrowser

-----------------------------------------------------------------------------------------

*** Wizdler

Parses the WSDL files and generates SOAP messages for you # Wizdler

Recognizes WSDL information on the page to show you the available services and operations. Click the operation to generate the SOAP requests and view the response. By clicking the service, you can download WSDL and external XSD files in single ZIP file.

-----------------------------------------------------------------------------------------

*** OpenAPI spec editing tools

Swagger YAML editing tool : http://editor.swagger.io/

use this to generate server code and client code as well.

Stoplight studio is another good one. 

-----------------------------------------------------------------------------------------

*** Putty

   change password : 
    #+BEGIN_EXAMPLE
    passwd
    #+END_EXAMPLE

 
-----------------------------------------------------------------------------------------

*** Calibre book-reader customization

   In order to increase line spacing in paragraphs:

   Preferences -> User Stylesheet -> p {line-height: 2}
 
-----------------------------------------------------------------------------------------

*** Command to put computer to sleep

    Windows:
    
      #+BEGIN_EXAMPLE
      rundll32.exe powrprof.dll,SetSuspendState 0,1,0
      #+END_EXAMPLE

-----------------------------------------------------------------------------------------

*** Mouse issues in Windows

    Mouse cursor disappears in any dialogue or text box or document : 
    
    If you want to change it to a larger one :
    Control Panel -> Large icons -> Mouse -> Pointers -> Normal Select -> Browse -> aero_arrow.cur (or any other one that you like)
    Control Panel -> Large icons -> Mouse -> Pointers -> Text Select -> Browse -> aero_arrow.cur (or any other one that you like)
    
    a. Open Control Panel. 
    b. In View by: Large icon view, click on Mouse.
    c. Click the Pointer options tab and uncheck Hide pointer while typing.
    d. Click on Apply and check the issue.

-----------------------------------------------------------------------------------------

*** Lenovo Thinkpad tips

    How do you turn on the light on top of the monitor?
    
    To turn on the small light on the top of the monitor (when working in the dark and it is very difficult to see the keyboard) 
    #+BEGIN_EXAMPLE
    Fn + PgUp
    #+END_EXAMPLE

-----------------------------------------------------------------------------------------

