HelpfulTools/HelpfulTools.org
*** Windows VDEs running out of memory

Hi all, the C drive in one of my VDE slices seems to be running out of memory. 
It came with 50 GB initially and now it has just about 100MB memory available in it. 
I freed up some space by uninstalling some of the programs I was not using all that often and that freed up about 1 GB of space in the C drive but all that free space quickly got filled up by some processes running in the background. 
I submitted a request for 'clean up C drive' but that seems to have failed - twice. 
I cannot do anything with that slice because of the lack of available memory. 
I requested a new slice but I am trying to understand what it is that went wrong with it. 
Did any of you see this happen in the past?

Download WizTree on your slice, it'll tell you where all of your space is being used up.

By using this tool, after determining that 'C:\Windows\ccmcache' is the folder taking up all the space,

The ccmcache folder is used by System Center Configuration Manager (SCCM) client. This is where files downloaded by SCCM are stored. SCCM is an enterprise software management system used in many Windows environment, and provides operating system and software deployment services, remote management, reporting services, etc. You will typically only find this folder on systems in a managed enterprise environment.
SCCM caches files used for software deployment in the ccmcache folder. This may include software packages which are automatically installed on your machine, some types of software updates, etc. Files are not automatically removed from the ccmcache folder after they are used, but they are marked as being eligible for deletion. You should not manually delete files in this folder as you may accidentally delete something which has not been used yet. You should definitely not remove the folder altogether, as this would break SCCM and you would cease to automatically receive software packages from your network administrator.
You should be able to reduce the size of this folder using the ConfigMgr Control Panel. This will require local administrator privileges. To do this:
Open "Configuration Manager Properties" in the control panel. You may need to change the control panel to "icon view" instead of "category view".
Go to the "cache" tab
Click "Configure Settings" and acknowledge the UAC Prompt if prompted
The "Delete Files" button should become available. Click this button to clear files. It will automatically keep any files which should not be deleted.

-----------------------------------------------------------------------------------------

*** Tree

    **How To View Directory Tree Structure In Linux**

    Today, we are going to learn how to view directory structure using Tree command. This command will display the contents of a directory in a tree-like format. You might wonder why on the earth someone would use this command whilst we already have ls command to list the contents of a directory. Unlike ls command, Tree command is a recursive directory listing program that produces a depth indented listing of files. It is quite useful to find the directories that contains lot of sub-directories in Unix-like systems.
    
    Install Tree
    Tree command is available in the default repositories of most Linux distributions. So, it can be installed from the distribution's default package.
    
    On Arch Linux and its derivatives: $ sudo pacman -S tree
    On RHEL, CentOS, Fedora: $ sudo yum install tree Or, $ sudo dnf install tree
    On SUSE/openSUSE: $ sudo zypper install tree
    On Debian, Linux Mint, Ubuntu: $ sudo apt-get install tree
    
    We have installed tree utility. Now, let us see some practical examples.

    **View Directory Tree Structure In Linux**
 
    If you run the tree command without any arguments, the tree command will display all contents of the current working directory in a tree-like format.  
        #+BEGIN_EXAMPLE
        $ tree
        #+END_EXAMPLE
    
    Upon completion of listing all files/directories found, tree returns the total number of files and/or directories listed. As you see in the above output, the current directory contains 3321 sub-directories, and 40023 files.
    
    
    To list the files of the specific directory in a tree-like format, say for example /etc, run:
    
        #+BEGIN_EXAMPLE
        $ tree /etc/
        #+END_EXAMPLE
    
    By default, Tree will notdoesn't list the hidden files. If you want to list the hidden files, use -a parameter like below.
        #+BEGIN_EXAMPLE
        $ tree -a /etc/
        #+END_EXAMPLE
    
    
    Now, check the above output. The total of number of directories and files are higher than the previous output. It is because, this time the tree command lists all directories and files including hidden files.
    
    
     
    To view the directory structure in a colored format, use -C parameter.
    
       #+BEGIN_EXAMPLE
       $ tree -C /etc/
       #+END_EXAMPLE
    
    Did you notice? Now, the tree command lists the directories and files in different colors. This is will useful to easily distinguish the directories and files.
    
     
    As you may have noticed, all of the above commands lists the sub-directories and files. You can also list only the directories using -d parameter like below.
    
       #+BEGIN_EXAMPLE
       $ tree -d /etc/
       #+END_EXAMPLE
    
    You can also display the directory listing line by line using the following command:
    
       #+BEGIN_EXAMPLE
       $ tree -d /etc/ | less
       #+END_EXAMPLE
    Press ENTER to navigate through the output.
    
    By default, Tree command will list all sub-directories and the files inside the main directory. To limit the depth or of level of recursion, use -L parameter like below.
       #+BEGIN_EXAMPLE
       $ tree -L 2 /etc
       #+END_EXAMPLE
    Here, L indicates the maximum display depth of the directory tree.
    
    For more details, refer the man pages.
 
    #+BEGIN_EXAMPLE
    $ man tree
    #+END_EXAMPLE
 
    **In Windows machines**
 
    #+BEGIN_EXAMPLE
    $ tree /a /f > Catalog.txt
    #+END_EXAMPLE
 
    Options:
    
    /A - Specifies that alternative characters (plus signs, hyphens, and vertical bars) be used to draw the tree diagram so that it can be printed by printers that don't support the line-drawing and box-drawing characters (DOS Versions 4 and 5).
    
    /F - Displays the names of the files found within each directory listed.
    
    
    Conclusion
    
    As you can see in this guide, tree command will give you a nice graphical tree view of the directory structure. You can use this command when you want to view the contents of directories that have tons of other files/folders nested inside their folders.

-----------------------------------------------------------------------------------------

