HelpfulTools/HelpfulTools.org
*** Tips for searching and copying files and directories :

How to do file search for a string in a folder (including its sub folders) in Windows?

    #+BEGIN_EXAMPLE
    C:\Users\user\Desktop\FolderName>findstr /S /I /M /C:"search text" *.*
    #+END_EXAMPLE

How to find files on windows modified/created after a given date using the command line? You can use PowerShell to do this :

    #+BEGIN_EXAMPLE
    Get-ChildItem -Recurse | Where-Object { $_.LastWriteTime -ge "12/27/2016" }
    #+END_EXAMPLE

This also works with time: 

    #+BEGIN_EXAMPLE
    { $_.LastWriteTime -ge "12/27/2016 20:00:00" }
    #+END_EXAMPLE

How to copy everything from one folder to another folder?

    #+BEGIN_EXAMPLE
    ROBOCOPY sourceFolder   destinationFolder /MIR /R:0 /W:0
    
    ROBOCOPY C:\Users\n123456\Desktop   C:\Users\n123456\Downloads\NewFolder /MIR /R:0 /W:0
    #+END_EXAMPLE
Be careful before using this command. If there are files or folders in the destination folder before using this command, they will all be erased. Make sure this command is used to copy files into a new folder only.


In Mac OSX: A few commands that help in copying files in Mac OSX:
    #+BEGIN_EXAMPLE
    cp -R "/Volumes/SIGNATURE/folder1" "/Users/explorer436/Google Drive"
    
    cp -R "/Volumes/SIGNATURE/folder2" "/Users/explorer436/Google Drive"
    
    cp -R "/Volumes/SIGNATURE/folder3/folder4/folder5" "/Volumes/SIGNATURE"
    #+END_EXAMPLE

To list the files and folders in a directory and to list their sizes:
    #+BEGIN_EXAMPLE
    du – displaying disk usage for a specific file, folder, directory, or whatever, is made easier to interpret with -h
    
    du -sh */
    #+END_EXAMPLE


While you are using cp command to copy huge folders, to find out how much data is copied, go to Applications -> Utilities -> Activity Monitor -> Disk view

And look at the process name 'cp'



To copy only missing files from one folder to another, use rsync :
    #+BEGIN_EXAMPLE
    rsync -av /Users/harshavardhanedupuganti/Google\ Drive/harsha_personal_stuff/  /Volumes/SIGNATURE/Google\ Drive/harsha_personal_stuff/

    rsync -av /source-path/source-dir /destination-path
    #+END_EXAMPLE
rsync will copy only new and changed files to the new location.

It is important to understand how a trailing slash on the source argument functions. If there is a trailing slash then the contents of /source-path/source-dir will be copied to destination-path. If there is no trailing slash then source-dir itself will be copied to the destination and its contents will be another level down in the destination hierarchy.

So if you want to replicate one path to another include the trailing slash as follows:
    #+BEGIN_EXAMPLE
    rsync -av /sourcepath/sourcedir/ /duplicatpath/sourcedir/
    #+END_EXAMPLE

-----------------------------------------------------------------------------------------

*** Killing a process

    **In Windows machines**
If you need to kill a process manually on Windows it’s actually pretty easy. First, fire up a command prompt and type the following command.
    #+BEGIN_EXAMPLE
    netstat -a -o -n
    #+END_EXAMPLE

To kill the process we need to find the PID of the process in question. I just run down the list by port until I find port 8080 and here you will see the process id was 28344.

Finally, with the PID we can run the following command to kill the process

    #+BEGIN_EXAMPLE
    taskkill /F /PID 28344
    #+END_EXAMPLE


    **In Linux**

This command will print you PID of process bound on that port :
    #+BEGIN_EXAMPLE
    fuser 8080/tcp
    #+END_EXAMPLE

And this command will kill that process : 
    #+BEGIN_EXAMPLE
    fuser -k 8080/tcp
    #+END_EXAMPLE

    **Issue with port 80 being blocked**

If anyone is running into issues with port 80 blocked while setting up their new slice, I have a workaround if you would like to use it. I have an open ticket with VDE support to see about getting the Citrix Virtual Desktop Service changed to a different port.  I will let you know when they have verified this fix or have a different workaround.
I have been able to successfully reboot my slice several times and log back into the Citrix Workspace with no issue.
Verify it is the Citrix Desktop Service running over port 80 by using the following command (as Admin):
    #+BEGIN_EXAMPLE
    netsh http show servicestate | findstr HTTP
    #+END_EXAMPLE
Run the following command to change its port (you should run netstat -aon to make sure the number you choose is free).
    #+BEGIN_EXAMPLE
    C:\Program Files\Citrix\Virtual Desktop Agent\Agent Configuration\Agentconfig.exe /portnumber:4150
    #+END_EXAMPLE
Restart the Citrix Service (or reboot your machine)

-----------------------------------------------------------------------------------------

*** Postman tips

Script to read fields from a JSON response and set it as a collection variable that can be used in the subsequent steps:
    #+BEGIN_EXAMPLE
    var jsonData = JSON.parse(responseBody);
    pm.collectionVariables.set("quoteId", jsonData.data.quoteId);
    #+END_EXAMPLE


Script to read fields from a SOAP response and set it as a collection variable that can be used in the subsequent steps:
    #+BEGIN_EXAMPLE
    var parseString = require('xml2js').parseString;
    var stripPrefix = require('xml2js').processors.stripPrefix;
    
    parseString(responseBody, { tagNameProcessors: [ stripPrefix ] }, function(err, js) {
        if(err) throw err;
    
        var companysQuoteNumber = js.Envelope.Body[0].rateResponse[0].response[0].HomePolicyQuoteInqRs[0].PersPolicy[0].QuoteInfo[0].CompanysQuoteNumber[0];
    
        pm.collectionVariables.set("companysQuoteNumber", companysQuoteNumber);
    });
    #+END_EXAMPLE

(A simpler way is to use xml2json but it will not remove the namespaces from the json and if the namespaces are dynamically changing, it can be a problem)

-----------------------------------------------------------------------------------------

*** Running jar files from terminal

    #+BEGIN_EXAMPLE
    java -jar jarFileName.jar
    #+END_EXAMPLE

-----------------------------------------------------------------------------------------

*** Cntlm

Updating password in cntlm : 

In a Linux slice, cntlm config file is usually located here : 

    #+BEGIN_EXAMPLE
    /etc/cntlm.conf
    or
    /usr/local/etc/cntlm.conf
    #+END_EXAMPLE

Many corporate security policies require regular password changes, CNTLM makes these very easy.

First, get the hashes for the new password with: 
    #+BEGIN_EXAMPLE
    cntlm -H
    #+END_EXAMPLE

Copy and paste those hashes into your cntlm.conf file located at: 
    #+BEGIN_EXAMPLE
    /etc/cntlm.conf
    or 
    /usr/local/etc/cntlm.conf
    #+END_EXAMPLE

(if you get this error while trying to edit the file : readonly option is set (add ! to override) - 
This happens when the user is trying to write on a file without the right permissions. Login as root using sudo su and now you can do the edit.)

Restart your CNTLM instance and reconnect, you should be good to go 
    #+BEGIN_EXAMPLE
    : brew services restart cntlm (if you have brew installed)
    #+END_EXAMPLE

If this doesn't work, restarting the slice using the command 'reboot' works.

-----------------------------------------------------------------------------------------

*** Commands to run tests on individual files

**Command to run cucumber tests alone if you are using gradle**

    #+BEGIN_EXAMPLE
    ./gradlew test --tests pagro.project.RunCukesTest*
    #+END_EXAMPLE

**for a javascript project**

    #+BEGIN_EXAMPLE
    npx jest ./src/main/module/Operation/OperationService.test.ts
    npm run test -- ./src/main/module/Operation/OperationService.test.ts
    #+END_EXAMPLE

-----------------------------------------------------------------------------------------

