HelpfulTools/HelpfulTools.org
*** Gradle commands

Go to the EAR folder in command prompt:

    #+BEGIN_EXAMPLE
    C:\XXXXXXXXXXXXXEAR
    #+END_EXAMPLE
And use this command to build EAR.

    #+BEGIN_EXAMPLE
    gradle clean ear --info
    gradle clean testall --info
    gradle clean testAll ear –-info
    #+END_EXAMPLE

From folder :      C:\XXXXXXXXXXEAR\build\distributions
To folder :        C:\WASLP_dev\tools\WASLP8559\wlp\usr\servers\default\dropins
Windows command to copy the EAR from a source folder to a destination folder:
    #+BEGIN_EXAMPLE
    xcopy C:\XXXXXXXXXXXXXXEAR\build\distributions C:\WASLP_dev\tools\WASLP8559\wlp\usr\servers\default\dropins
    #+END_EXAMPLE

From folder :      C:\Users\n0281526\Documents\services-property-insurance-partner-exchange\PiAcordSalesMediationServiceEAR
To folder :        C:\WASLP_dev\tools\WASLP8559\wlp\usr\servers\default\dropins
Windows command to copy the EAR from a source folder to a destination folder:
    #+BEGIN_EXAMPLE
    xcopy C:\WASLP_dev\workspaces\git_repo\services-property-insurance-partner-exchange\PiAcordSalesMediationServiceEAR\build\distributions C:\WASLP_dev\tools\WASLP8559\wlp\usr\servers\default\dropins
    #+END_EXAMPLE


To exclude a few tasks from the build process : 
    #+BEGIN_EXAMPLE
    ./gradlew build -x checkstyleMain -x findbugsMain -x test -x jacocoTestCoverageVerification -x pmdMain
    #+END_EXAMPLE

-----------------------------------------------------------------------------------------

*** Cygwin

Cygwin Must Have Packages - Tutorial Table of Contents

Cygwin: 3:05 : https://www.cygwin.com

**Packages**

lynx, wget, curl, rsync

python, python3

bzip, tar

bash-completion

vim, vim-common

tmux

git

diffutils

make

gcc-c, gcc-g++, gcc-fortran

openssh

 

**Useful Stuff**

cd /bin

curl https://github.com/git/git/raw/master/contrib/completion/git-completion.bash -OL

# source is to turn it on. Basically, we are reloading.

source git-completion.bash

 

# Forgot to add this following line to ~/.bashrc in the video

source /bin/git-completion.bash

# Save and quit

 
source ~/.bashrc

 

**Download apt-cyg. It is used to install packages**

# Greater than sign is not allowed in the description. Change greaterThanSign to a greater than sign.

cd ~

lynx -source rawgit.com/transcode-open/apt-cyg/master/apt-cyg greaterThanSign apt-cyg

OR

curl rawgit.com/transcode-open/apt-cyg/master/apt-cyg -OL -k

 

After that, run this:

install apt-cyg /bin

 

**How to use apt-cyg to install packages?**


apt-cyg install nano

apt-cyg install zip

apt-cyg install unzip

 

Next, lets add some shortcuts. Open bashrc file. You can use Vim or nano.

vim ~/.bashrc or nano ~/.bashrc

 

# Add the following lines to ~/.bashrc (~/.bashrc is a settings file that runs commands every time the terminal opens)

alias desktop="cd C:/Users/huyle/Desktop"

# We can use open for file explorer. e.g. When you are in Desktop in cygwin, type 'open .' to open it in file explorer.

alias open='cygstart'

# If we need to make changes to bashrc file and reload them:

alias reload='source ~/.bash_profile'

export PATH="${HOME}/bin:${PATH}"

 

After making these changes, 'source' the bashrc file using 'source ~/.bashrc'

 

**Tabs and Hotkeys**

Cygwin does not have tabs. So, we have to use something else that supports tabs.

Use Console2 or any of your favorite terminal emulators.

Console2: https://sourceforge.net/projects/cons...


These will be helpful while configuring the terminal emulator to use Cygwin.

For icon, use this: "C:\cygwin64\Cygwin-Terminal.ico"

For shell, use this: "C:\cygwin64\bin\mintty.exe"

 

**Integrate with Command Prompt**

For 64 bit, add C:\Users\<username>\cygwin64\bin; to the end of the environment variables.

-----------------------------------------------------------------------------------------

*** Hosts file

   Access your hosts file on your services slice (C:\Windows\System32\drivers\etc)
 
-----------------------------------------------------------------------------------------

*** SonarQube

How to run SonarQube in local slice or developer machine ?

Get Started in Two Minutes Guide
Download the SonarQube Community Edition

Unzip it, let's say in C:\sonarqube or /etc/sonarqube

Start the SonarQube Server:

# On Windows, execute:
    #+BEGIN_EXAMPLE
    C:\sonarqube\bin\windows-x86-xx\StartSonar.bat
    #+END_EXAMPLE

# On other operating systems, execute:
    #+BEGIN_EXAMPLE
    /etc/sonarqube/bin/[OS]/sonar.sh console
    #+END_EXAMPLE

Log in to http://localhost:9000 with System Administrator credentials (admin/admin)


For multi-language projects, remove the property "sonar.language=java" from "sonar-project.properties"

-----------------------------------------------------------------------------------------

*** WID - clean and build tips

List only files of a particular extension with the DIR command:

    #+BEGIN_EXAMPLE
    `dir *.class`
    
    `dir /S *.class`
    #+END_EXAMPLE

will show files with ".class" suffix in specified directory and all sub-directories.
This approach works with files of any extension. e.g. .txt

When you do a full clean/build within wid it takes quite some time to do the clean part.  
So, before you do a clean/build,  close WID, then go into a cmd prompt into your workspace and
use the command  'del *.class /s' to delete the compiled class files.
It takes about 10 seconds instead of letting wid do the clean in like 15 minutes.

-----------------------------------------------------------------------------------------

*** Issues encountered while working with MongoDB

Issues encountered while working on Employee Lambdas using MongoDB : 

mongodb is refusing connections:
go to AWS security group and open up port 27107 (port range 0 - 65535)

-----------------------------------------------------------------------------------------

A website that displays the information that the browser can collect from the computer:
This shows what info the browser can send to other parties with/without our consent.

https://www.deviceinfo.me/

-----------------------------------------------------------------------------------------
